<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

    <Argument name="username" type="_496" location="f0:765" file="f0" line="765"/>
    <Argument name="password" type="_496" location="f0:765" file="f0" line="765"/>
    <Argument name="remember_me" type="_494" location="f0:765" file="f0" line="765"/>
    <Argument name="blob" type="_496" location="f0:765" file="f0" line="765"/>
  </Function>
  <Function id="_472" name="sp_search_add_ref" returns="_444" context="_1" location="f0:2708" file="f0" line="2708" extern="1">
    <Argument name="search" type="_546" location="f0:2708" file="f0" line="2708"/>
  </Function>
  <Function id="_473" name="sp_search_total_tracks" returns="_60" context="_1" location="f0:2666" file="f0" line="2666" extern="1">
    <Argument name="search" type="_546" location="f0:2666" file="f0" line="2666"/>
  </Function>
  <Function id="_474" name="sp_playlistcontainer_remove_callbacks" returns="_444" context="_1" location="f0:3398" file="f0" line="3398" extern="1">
    <Argument name="pc" type="_524" location="f0:3398" file="f0" line="3398"/>
    <Argument name="callbacks" type="_592" location="f0:3398" file="f0" line="3398"/>
    <Argument name="userdata" type="_541" location="f0:3398" file="f0" line="3398"/>
  </Function>
  <Function id="_475" name="sp_playlist_num_subscribers" returns="_194" context="_1" location="f0:3160" file="f0" line="3160" extern="1">
    <Argument name="playlist" type="_493" location="f0:3160" file="f0" line="3160"/>
  </Function>
  <Function id="_476" name="sp_playlist_has_pending_changes" returns="_494" context="_1" location="f0:3101" file="f0" line="3101" extern="1">
    <Argument name="playlist" type="_493" location="f0:3101" file="f0" line="3101"/>
  </Function>
  <Function id="_477" name="sp_artistbrowse_backend_request_duration" returns="_60" context="_1" location="f0:2301" file="f0" line="2301" extern="1">
    <Argument name="arb" type="_537" location="f0:2301" file="f0" line="2301"/>
  </Function>
  <Function id="_478" name="sp_playlist_get_offline_download_completed" returns="_60" context="_1" location="f0:3294" file="f0" line="3294" extern="1">
    <Argument name="session" type="_520" location="f0:3294" file="f0" line="3294"/>
    <Argument name="playlist" type="_493" location="f0:3294" file="f0" line="3294"/>
  </Function>
  <Function id="_479" name="sp_artist_release" returns="_444" context="_1" location="f0:1933" file="f0" line="1933" extern="1">
    <Argument name="artist" type="_523" location="f0:1933" file="f0" line="1933"/>
  </Function>
  <Typedef id="_480" name="uint_least8_t" type="_376" context="_1" location="f2:63" file="f2" line="63"/>
  <Enumeration id="_481" name="sp_image_size" context="_1" location="f0:261" file="f0" line="261" artificial="1" size="32" align="32">
    <EnumValue name="SP_IMAGE_SIZE_NORMAL" init="0"/>
    <EnumValue name="SP_IMAGE_SIZE_SMALL" init="1"/>
    <EnumValue name="SP_IMAGE_SIZE_LARGE" init="2"/>
  </Enumeration>
  <Typedef id="_482" name="sp_image_size" type="_481" context="_1" location="f0:265" file="f0" line="265"/>
  <Function id="_483" name="sp_image_release" returns="_444" context="_1" location="f0:2467" file="f0" line="2467" extern="1">
    <Argument name="image" type="_528" location="f0:2467" file="f0" line="2467"/>
  </Function>
  <Function id="_484" name="sp_artistbrowse_tophit_track" returns="_499" context="_1" location="f0:2237" file="f0" line="2237" extern="1">
    <Argument name="arb" type="_537" location="f0:2237" file="f0" line="2237"/>
    <Argument name="index" type="_60" location="f0:2237" file="f0" line="2237"/>
  </Function>
  <Function id="_485" name="sp_session_release" returns="_444" context="_1" location="f0:741" file="f0" line="741" extern="1">
    <Argument name="sess" type="_520" location="f0:741" file="f0" line="741"/>
  </Function>
  <Function id="_486" name="__builtin_sinf" returns="_497" context="_1" mangled="sinf" location="f1:76" file="f1" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_497" location="f1:76" file="f1" line="76"/>
  </Function>
  <Function id="_487" name="__builtin_sinh" returns="_495" context="_1" mangled="sinh" location="f1:77" file="f1" line="77" extern="1" attributes="nothrow pure no vops">
    <Argument type="_495" location="f1:77" file="f1" line="77"/>
  </Function>
  <Function id="_488" name="__builtin_sinl" returns="_498" context="_1" mangled="sinl" location="f1:80" file="f1" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_498" location="f1:80" file="f1" line="80"/>
  </Function>
  <Typedef id="_489" name="uint64_t" type="_7" context="_1" location="f2:55" file="f2" line="55"/>
  <Function id="_490" name="__builtin_csin" returns="_527" context="_1" mangled="csin" location="f1:115" file="f1" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_527" location="f1:115" file="f1" line="115"/>
  </Function>
  <Function id="_491" name="sp_toplistbrowse_error" returns="_444" context="_1" location="f0:3758" file="f0" line="3758" extern="1">
    <Argument name="tlb" type="_519" location="f0:3758" file="f0" line="3758"/>
  </Function>
  <Function id="_492" name="sp_track_is_local" returns="_494" context="_1" location="f0:1577" file="f0" line="1577" extern="1">
    <Argument name="session" type="_520" location="f0:1577" file="f0" line="1577"/>
    <Argument name="track" type="_499" location="f0:1577" file="f0" line="1577"/>
  </Function>
  <PointerType id="_493" type="_401" size="32" align="32"/>
  <FundamentalType id="_494" name="bool" size="8" align="8"/>
  <FundamentalType id="_495" name="double" size="64" align="64"/>
  <PointerType id="_496" type="_644c" size="32" align="32"/>
  <FundamentalType id="_497" name="float" size="32" align="32"/>
  <FundamentalType id="_498" name="long double" size="128" align="128"/>
  <PointerType id="_499" type="_55" size="32" align="32"/>
  <FundamentalType id="_500" name="complex float" size="64" align="32"/>
  <FundamentalType id="_501" name="complex long double" size="256" align="128"/>
  <Field id="_502" name="tracks_added" type="_646" offset="0" context="_19" access="public" location="f0:2753" file="f0" line="2753"/>
  <Field id="_503" name="tracks_removed" type="_647" offset="32" context="_19" access="public" location="f0:2763" file="f0" line="2763"/>
  <Field id="_504" name="tracks_moved" type="_648" offset="64" context="_19" access="public" location="f0:2774" file="f0" line="2774"/>
  <Field id="_505" name="playlist_renamed" type="_649" offset="96" context="_19" access="public" location="f0:2782" file="f0" line="2782"/>
  <Field id="_506" name="playlist_state_changed" type="_649" offset="128" context="_19" access="public" location="f0:2798" file="f0" line="2798"/>
  <Field id="_507" name="playlist_update_in_progress" type="_650" offset="160" context="_19" access="public" location="f0:2811" file="f0" line="2811"/>
  <Field id="_508" name="playlist_metadata_updated" type="_649" offset="192" context="_19" access="public" location="f0:2819" file="f0" line="2819"/>
  <Field id="_509" name="track_created_changed" type="_651" offset="224" context="_19" access="public" location="f0:2830" file="f0" line="2830"/>
  <Field id="_510" name="track_seen_changed" type="_652" offset="256" context="_19" access="public" location="f0:2840" file="f0" line="2840"/>
  <Field id="_511" name="description_changed" type="_653" offset="288" context="_19" access="public" location="f0:2849" file="f0" line="2849"/>
  <Field id="_512" name="image_changed" type="_654" offset="320" context="_19" access="public" location="f0:2859" file="f0" line="2859"/>
  <Field id="_513" name="track_message_changed" type="_655" offset="352" context="_19" access="public" location="f0:2870" file="f0" line="2870"/>
  <Field id="_514" name="subscribers_changed" type="_649" offset="384" context="_19" access="public" location="f0:2879" file="f0" line="2879"/>
  <Destructor id="_515" name="sp_playlist_callbacks" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksD1Ev *INTERNAL* " demangled="sp_playlist_callbacks::~sp_playlist_callbacks()" location="f0:2742" file="f0" line="2742" endline="2742" inline="1">
  </Destructor>
  <OperatorMethod id="_516" name="=" returns="_656" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksaSERKS_" demangled="sp_playlist_callbacks::operator=(sp_playlist_callbacks const&amp;)" location="f0:2742" file="f0" line="2742" endline="2742" inline="1">
    <Argument type="_657" location="f0:2742" file="f0" line="2742"/>
  </OperatorMethod>
  <Constructor id="_517" name="sp_playlist_callbacks" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksC1ERKS_ *INTERNAL* " demangled="sp_playlist_callbacks::sp_playlist_callbacks(sp_playlist_callbacks const&amp;)" location="f0:2742" file="f0" line="2742" endline="2742" inline="1">
    <Argument type="_657" location="f0:2742" file="f0" line="2742"/>
  </Constructor>
  <Constructor id="_518" name="sp_playlist_callbacks" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksC1Ev *INTERNAL* " demangled="sp_playlist_callbacks::sp_playlist_callbacks()" location="f0:2742" file="f0" line="2742" inline="1"/>
  <PointerType id="_519" type="_99" size="32" align="32"/>
  <PointerType id="_520" type="_227" size="32" align="32"/>
  <PointerType id="_521" type="_76" size="32" align="32"/>
  <PointerType id="_522" type="_123" size="32" align="32"/>
  <PointerType id="_523" type="_70" size="32" align="32"/>
  <PointerType id="_524" type="_139" size="32" align="32"/>
  <PointerType id="_525" type="_499" size="32" align="32"/>
  <PointerType id="_526" type="_644" size="32" align="32"/>
  <FundamentalType id="_527" name="complex double" size="128" align="64"/>
  <PointerType id="_528" type="_79" size="32" align="32"/>
  <PointerType id="_529" type="_330" size="32" align="32"/>
  <Field id="_530" name="count" type="_194" offset="0" context="_62" access="public" location="f0:279" file="f0" line="279"/>
  <Field id="_531" name="subscribers" type="_658" offset="32" context="_62" access="public" location="f0:280" file="f0" line="280"/>
  <Destructor id="_532" name="sp_subscribers" artificial="1" throw="" context="_62" access="public" mangled="_ZN14sp_subscribersD1Ev *INTERNAL* " demangled="sp_subscribers::~sp_subscribers()" location="f0:278" file="f0" line="278" endline="278" inline="1">
  </Destructor>
  <OperatorMethod id="_533" name="=" returns="_659" artificial="1" throw="" context="_62" access="public" mangled="_ZN14sp_subscribersaSERKS_" demangled="sp_subscribers::operator=(sp_subscribers const&amp;)" location="f0:278" file="f0" line="278" endline="278" inline="1">
    <Argument type="_660" location="f0:278" file="f0" line="278"/>
  </OperatorMethod>
  <Constructor id="_534" name="sp_subscribers" artificial="1" throw="" context="_62" access="public" mangled="_ZN14sp_subscribersC1ERKS_ *INTERNAL* " demangled="sp_subscribers::sp_subscribers(sp_subscribers const&amp;)" location="f0:278" file="f0" line="278" endline="278" inline="1">
    <Argument type="_660" location="f0:278" file="f0" line="278"/>
  </Constructor>
  <Constructor id="_535" name="sp_subscribers" artificial="1" throw="" context="_62" access="public" mangled="_ZN14sp_subscribersC1Ev *INTERNAL* " demangled="sp_subscribers::sp_subscribers()" location="f0:278" file="f0" line="278" inline="1"/>
  <PointerType id="_536" type="_416" size="32" align="32"/>
  <PointerType id="_537" type="_219" size="32" align="32"/>
  <PointerType id="_538" type="_386" size="32" align="32"/>
  <PointerType id="_539" type="_499c" size="32" align="32"/>
  <PointerType id="_540" type="_450" size="32" align="32"/>
  <PointerType id="_541" type="_543" size="32" align="32"/>
  <PointerType id="_542" type="_245" size="32" align="32"/>
  <FundamentalType id="_543" name="void" align="8"/>
  <PointerType id="_544" type="_151" size="32" align="32"/>
  <PointerType id="_545" type="_416c" size="32" align="32"/>
  <PointerType id="_546" type="_216" size="32" align="32"/>
  <PointerType id="_547" type="_469" size="32" align="32"/>
  <PointerType id="_548" type="_60" size="32" align="32"/>
  <Field id="_549" name="api_version" type="_60" offset="0" context="_171" access="public" location="f0:644" file="f0" line="644"/>
  <Field id="_550" name="cache_location" type="_496" offset="32" context="_171" access="public" location="f0:645" file="f0" line="645"/>
  <Field id="_551" name="settings_location" type="_496" offset="64" context="_171" access="public" location="f0:649" file="f0" line="649"/>
  <Field id="_552" name="application_key" type="_573" offset="96" context="_171" access="public" location="f0:655" file="f0" line="655"/>
  <Field id="_553" name="application_key_size" type="_306" offset="128" context="_171" access="public" location="f0:656" file="f0" line="656"/>
  <Field id="_554" name="user_agent" type="_496" offset="160" context="_171" access="public" location="f0:657" file="f0" line="657"/>
  <Field id="_555" name="callbacks" type="_663" offset="192" context="_171" access="public" location="f0:661" file="f0" line="661"/>
  <Field id="_556" name="userdata" type="_541" offset="224" context="_171" access="public" location="f0:662" file="f0" line="662"/>
  <Field id="_557" name="compress_playlists" type="_494" offset="256" context="_171" access="public" location="f0:667" file="f0" line="667"/>
  <Field id="_558" name="dont_save_metadata_for_playlists" type="_494" offset="264" context="_171" access="public" location="f0:674" file="f0" line="674"/>
  <Field id="_559" name="initially_unload_playlists" type="_494" offset="272" context="_171" access="public" location="f0:680" file="f0" line="680"/>
  <Field id="_560" name="device_id" type="_496" offset="288" context="_171" access="public" location="f0:687" file="f0" line="687"/>
  <Field id="_561" name="proxy" type="_496" offset="320" context="_171" access="public" location="f0:693" file="f0" line="693"/>
  <Field id="_562" name="proxy_username" type="_496" offset="352" context="_171" access="public" location="f0:697" file="f0" line="697"/>
  <Field id="_563" name="proxy_password" type="_496" offset="384" context="_171" access="public" location="f0:701" file="f0" line="701"/>
  <Field id="_564" name="tracefile" type="_496" offset="416" context="_171" access="public" location="f0:707" file="f0" line="707"/>
  <Destructor id="_565" name="sp_session_config" artificial="1" throw="" context="_171" access="public" mangled="_ZN17sp_session_configD1Ev *INTERNAL* " demangled="sp_session_config::~sp_session_config()" location="f0:643" file="f0" line="643" endline="643" inline="1">
  </Destructor>
  <OperatorMethod id="_566" name="=" returns="_664" artificial="1" throw="" context="_171" access="public" mangled="_ZN17sp_session_configaSERKS_" demangled="sp_session_config::operator=(sp_session_config const&amp;)" location="f0:643" file="f0" line="643" endline="643" inline="1">
    <Argument type="_665" location="f0:643" file="f0" line="643"/>
  </OperatorMethod>
  <Constructor id="_567" name="sp_session_config" artificial="1" throw="" context="_171" access="public" mangled="_ZN17sp_session_configC1ERKS_ *INTERNAL* " demangled="sp_session_config::sp_session_config(sp_session_config const&amp;)" location="f0:643" file="f0" line="643" endline="643" inline="1">
    <Argument type="_665" location="f0:643" file="f0" line="643"/>
  </Constructor>
  <Constructor id="_568" name="sp_session_config" artificial="1" throw="" context="_171" access="public" mangled="_ZN17sp_session_configC1Ev *INTERNAL* " demangled="sp_session_config::sp_session_config()" location="f0:643" file="f0" line="643" inline="1"/>
  <PointerType id="_569" type="_410" size="32" align="32"/>
  <PointerType id="_570" type="_20" size="32" align="32"/>
  <PointerType id="_571" type="_497" size="32" align="32"/>
  <PointerType id="_572" type="_498" size="32" align="32"/>
  <PointerType id="_573" type="_543c" size="32" align="32"/>
  <Field id="_574" name="samples" type="_60" offset="0" context="_190" access="public" location="f0:271" file="f0" line="271"/>
  <Field id="_575" name="stutter" type="_60" offset="32" context="_190" access="public" location="f0:272" file="f0" line="272"/>
  <Destructor id="_576" name="sp_audio_buffer_stats" artificial="1" throw="" context="_190" access="public" mangled="_ZN21sp_audio_buffer_statsD1Ev *INTERNAL* " demangled="sp_audio_buffer_stats::~sp_audio_buffer_stats()" location="f0:270" file="f0" line="270" endline="270" inline="1">
  </Destructor>
  <OperatorMethod id="_577" name="=" returns="_667" artificial="1" throw="" context="_190" access="public" mangled="_ZN21sp_audio_buffer_statsaSERKS_" demangled="sp_audio_buffer_stats::operator=(sp_audio_buffer_stats const&amp;)" location="f0:270" file="f0" line="270" endline="270" inline="1">
    <Argument type="_668" location="f0:270" file="f0" line="270"/>
  </OperatorMethod>
  <Constructor id="_578" name="sp_audio_buffer_stats" artificial="1" throw="" context="_190" access="public" mangled="_ZN21sp_audio_buffer_statsC1ERKS_ *INTERNAL* " demangled="sp_audio_buffer_stats::sp_audio_buffer_stats(sp_audio_buffer_stats const&amp;)" location="f0:270" file="f0" line="270" endline="270" inline="1">
    <Argument type="_668" location="f0:270" file="f0" line="270"/>
  </Constructor>
  <Constructor id="_579" name="sp_audio_buffer_stats" artificial="1" throw="" context="_190" access="public" mangled="_ZN21sp_audio_buffer_statsC1Ev *INTERNAL* " demangled="sp_audio_buffer_stats::sp_audio_buffer_stats()" location="f0:270" file="f0" line="270" inline="1"/>
  <PointerType id="_580" type="_306" size="32" align="32"/>
  <PointerType id="_581" type="_255" size="32" align="32"/>
  <Field id="_582" name="sample_type" type="_393" offset="0" context="_269" access="public" location="f0:190" file="f0" line="190"/>
  <Field id="_583" name="sample_rate" type="_60" offset="32" context="_269" access="public" location="f0:191" file="f0" line="191"/>
  <Field id="_584" name="channels" type="_60" offset="64" context="_269" access="public" location="f0:192" file="f0" line="192"/>
  <Destructor id="_585" name="sp_audioformat" artificial="1" throw="" context="_269" access="public" mangled="_ZN14sp_audioformatD1Ev *INTERNAL* " demangled="sp_audioformat::~sp_audioformat()" location="f0:189" file="f0" line="189" endline="189" inline="1">
  </Destructor>
  <OperatorMethod id="_586" name="=" returns="_669" artificial="1" throw="" context="_269" access="public" mangled="_ZN14sp_audioformataSERKS_" demangled="sp_audioformat::operator=(sp_audioformat const&amp;)" location="f0:189" file="f0" line="189" endline="189" inline="1">
    <Argument type="_670" location="f0:189" file="f0" line="189"/>
  </OperatorMethod>
  <Constructor id="_587" name="sp_audioformat" artificial="1" throw="" context="_269" access="public" mangled="_ZN14sp_audioformatC1ERKS_ *INTERNAL* " demangled="sp_audioformat::sp_audioformat(sp_audioformat const&amp;)" location="f0:189" file="f0" line="189" endline="189" inline="1">
    <Argument type="_670" location="f0:189" file="f0" line="189"/>
  </Constructor>
  <Constructor id="_588" name="sp_audioformat" artificial="1" throw="" context="_269" access="public" mangled="_ZN14sp_audioformatC1Ev *INTERNAL* " demangled="sp_audioformat::sp_audioformat()" location="f0:189" file="f0" line="189" inline="1"/>
  <PointerType id="_589" type="_172c" size="32" align="32"/>
  <PointerType id="_590" type="_520" size="32" align="32"/>
  <PointerType id="_591" type="_128" size="32" align="32"/>
  <PointerType id="_592" type="_336" size="32" align="32"/>
  <Field id="_593" name="logged_in" type="_672" offset="0" context="_321" access="public" location="f0:409" file="f0" line="409"/>
  <Field id="_594" name="logged_out" type="_673" offset="32" context="_321" access="public" location="f0:418" file="f0" line="418"/>
  <Field id="_595" name="metadata_updated" type="_673" offset="64" context="_321" access="public" location="f0:427" file="f0" line="427"/>
  <Field id="_596" name="connection_error" type="_672" offset="96" context="_321" access="public" location="f0:446" file="f0" line="446"/>
  <Field id="_597" name="message_to_user" type="_674" offset="128" context="_321" access="public" location="f0:457" file="f0" line="457"/>
  <Field id="_598" name="notify_main_thread" type="_673" offset="160" context="_321" access="public" location="f0:470" file="f0" line="470"/>
  <Field id="_599" name="music_delivery" type="_675" offset="192" context="_321" access="public" location="f0:491" file="f0" line="491"/>
  <Field id="_600" name="play_token_lost" type="_673" offset="224" context="_321" access="public" location="f0:509" file="f0" line="509"/>
  <Field id="_601" name="log_message" type="_674" offset="256" context="_321" access="public" location="f0:517" file="f0" line="517"/>
  <Field id="_602" name="end_of_track" type="_673" offset="288" context="_321" access="public" location="f0:527" file="f0" line="527"/>
  <Field id="_603" name="streaming_error" type="_672" offset="320" context="_321" access="public" location="f0:541" file="f0" line="541"/>
  <Field id="_604" name="userinfo_updated" type="_673" offset="352" context="_321" access="public" location="f0:548" file="f0" line="548"/>
  <Field id="_605" name="start_playback" type="_673" offset="384" context="_321" access="public" location="f0:561" file="f0" line="561"/>
  <Field id="_606" name="stop_playback" type="_673" offset="416" context="_321" access="public" location="f0:575" file="f0" line="575"/>
  <Field id="_607" name="get_audio_buffer_stats" type="_676" offset="448" context="_321" access="public" location="f0:587" file="f0" line="587"/>
  <Field id="_608" name="offline_status_updated" type="_673" offset="480" context="_321" access="public" location="f0:594" file="f0" line="594"/>
  <Field id="_609" name="offline_error" type="_672" offset="512" context="_321" access="public" location="f0:603" file="f0" line="603"/>
  <Field id="_610" name="credentials_blob_updated" type="_674" offset="544" context="_321" access="public" location="f0:614" file="f0" line="614"/>
  <Field id="_611" name="connectionstate_updated" type="_673" offset="576" context="_321" access="public" location="f0:621" file="f0" line="621"/>
  <Field id="_612" name="scrobble_error" type="_672" offset="608" context="_321" access="public" location="f0:629" file="f0" line="629"/>
  <Field id="_613" name="private_session_mode_changed" type="_677" offset="640" context="_321" access="public" location="f0:637" file="f0" line="637"/>
  <Destructor id="_614" name="sp_session_callbacks" artificial="1" throw="" context="_321" access="public" mangled="_ZN20sp_session_callbacksD1Ev *INTERNAL* " demangled="sp_session_callbacks::~sp_session_callbacks()" location="f0:393" file="f0" line="393" endline="393" inline="1">
  </Destructor>
  <OperatorMethod id="_615" name="=" returns="_678" artificial="1" throw="" context="_321" access="public" mangled="_ZN20sp_session_callbacksaSERKS_" demangled="sp_session_callbacks::operator=(sp_session_callbacks const&amp;)" location="f0:393" file="f0" line="393" endline="393" inline="1">
    <Argument type="_679" location="f0:393" file="f0" line="393"/>
  </OperatorMethod>
  <Constructor id="_616" name="sp_session_callbacks" artificial="1" throw="" context="_321" access="public" mangled="_ZN20sp_session_callbacksC1ERKS_ *INTERNAL* " demangled="sp_session_callbacks::sp_session_callbacks(sp_session_callbacks const&amp;)" location="f0:393" file="f0" line="393" endline="393" inline="1">
    <Argument type="_679" location="f0:393" file="f0" line="393"/>
  </Constructor>
  <Constructor id="_617" name="sp_session_callbacks" artificial="1" throw="" context="_321" access="public" mangled="_ZN20sp_session_callbacksC1Ev *INTERNAL* " demangled="sp_session_callbacks::sp_session_callbacks()" location="f0:393" file="f0" line="393" inline="1"/>
  <PointerType id="_618" type="_60c" size="32" align="32"/>
  <Field id="_619" name="playlist_added" type="_681" offset="0" context="_335" access="public" location="f0:3331" file="f0" line="3331"/>
  <Field id="_620" name="playlist_removed" type="_681" offset="32" context="_335" access="public" location="f0:3342" file="f0" line="3342"/>
  <Field id="_621" name="playlist_moved" type="_682" offset="64" context="_335" access="public" location="f0:3354" file="f0" line="3354"/>
  <Field id="_622" name="container_loaded" type="_683" offset="96" context="_335" access="public" location="f0:3362" file="f0" line="3362"/>
  <Destructor id="_623" name="sp_playlistcontainer_callbacks" artificial="1" throw="" context="_335" access="public" mangled="_ZN30sp_playlistcontainer_callbacksD1Ev *INTERNAL* " demangled="sp_playlistcontainer_callbacks::~sp_playlistcontainer_callbacks()" location="f0:3322" file="f0" line="3322" endline="3322" inline="1">
  </Destructor>
  <OperatorMethod id="_624" name="=" returns="_684" artificial="1" throw="" context="_335" access="public" mangled="_ZN30sp_playlistcontainer_callbacksaSERKS_" demangled="sp_playlistcontainer_callbacks::operator=(sp_playlistcontainer_callbacks const&amp;)" location="f0:3322" file="f0" line="3322" endline="3322" inline="1">
    <Argument type="_685" location="f0:3322" file="f0" line="3322"/>
  </OperatorMethod>
  <Constructor id="_625" name="sp_playlistcontainer_callbacks" artificial="1" throw="" context="_335" access="public" mangled="_ZN30sp_playlistcontainer_callbacksC1ERKS_ *INTERNAL* " demangled="sp_playlistcontainer_callbacks::sp_playlistcontainer_callbacks(sp_playlistcontainer_callbacks const&amp;)" location="f0:3322" file="f0" line="3322" endline="3322" inline="1">
    <Argument type="_685" location="f0:3322" file="f0" line="3322"/>
  </Constructor>
  <Constructor id="_626" name="sp_playlistcontainer_callbacks" artificial="1" throw="" context="_335" access="public" mangled="_ZN30sp_playlistcontainer_callbacksC1Ev *INTERNAL* " demangled="sp_playlistcontainer_callbacks::sp_playlistcontainer_callbacks()" location="f0:3322" file="f0" line="3322" inline="1"/>
  <PointerType id="_627" type="_166" size="32" align="32"/>
  <PointerType id="_628" type="_63" size="32" align="32"/>
  <PointerType id="_629" type="_438" size="32" align="32"/>
  <PointerType id="_630" type="_494" size="32" align="32"/>
  <Field id="_631" name="queued_tracks" type="_60" offset="0" context="_437" access="public" location="f0:350" file="f0" line="350"/>
  <Field id="_632" name="queued_bytes" type="_8" offset="32" context="_437" access="public" location="f0:351" file="f0" line="351"/>
  <Field id="_633" name="done_tracks" type="_60" offset="96" context="_437" access="public" location="f0:357" file="f0" line="357"/>
  <Field id="_634" name="done_bytes" type="_8" offset="128" context="_437" access="public" location="f0:358" file="f0" line="358"/>
  <Field id="_635" name="copied_tracks" type="_60" offset="192" context="_437" access="public" location="f0:364" file="f0" line="364"/>
  <Field id="_636" name="copied_bytes" type="_8" offset="224" context="_437" access="public" location="f0:365" file="f0" line="365"/>
  <Field id="_637" name="willnotcopy_tracks" type="_60" offset="288" context="_437" access="public" location="f0:371" file="f0" line="371"/>
  <Field id="_638" name="error_tracks" type="_60" offset="320" context="_437" access="public" location="f0:377" file="f0" line="377"/>
  <Field id="_639" name="syncing" type="_494" offset="352" context="_437" access="public" location="f0:382" file="f0" line="382"/>
  <Destructor id="_640" name="sp_offline_sync_status" artificial="1" throw="" context="_437" access="public" mangled="_ZN22sp_offline_sync_statusD1Ev *INTERNAL* " demangled="sp_offline_sync_status::~sp_offline_sync_status()" location="f0:345" file="f0" line="345" endline="345" inline="1">
  </Destructor>
  <OperatorMethod id="_641" name="=" returns="_686" artificial="1" throw="" context="_437" access="public" mangled="_ZN22sp_offline_sync_statusaSERKS_" demangled="sp_offline_sync_status::operator=(sp_offline_sync_status const&amp;)" location="f0:345" file="f0" line="345" endline="345" inline="1">
    <Argument type="_687" location="f0:345" file="f0" line="345"/>
  </OperatorMethod>
  <Constructor id="_642" name="sp_offline_sync_status" artificial="1" throw="" context="_437" access="public" mangled="_ZN22sp_offline_sync_statusC1ERKS_ *INTERNAL* " demangled="sp_offline_sync_status::sp_offline_sync_status(sp_offline_sync_status const&amp;)" location="f0:345" file="f0" line="345" endline="345" inline="1">
    <Argument type="_687" location="f0:345" file="f0" line="345"/>
  </Constructor>
  <Constructor id="_643" name="sp_offline_sync_status" artificial="1" throw="" context="_437" access="public" mangled="_ZN22sp_offline_sync_statusC1Ev *INTERNAL* " demangled="sp_offline_sync_status::sp_offline_sync_status()" location="f0:345" file="f0" line="345" inline="1"/>
  <PointerType id="_646" type="_688" size="32" align="32"/>
  <PointerType id="_647" type="_689" size="32" align="32"/>
  <PointerType id="_648" type="_690" size="32" align="32"/>
  <PointerType id="_649" type="_691" size="32" align="32"/>
  <PointerType id="_650" type="_692" size="32" align="32"/>
  <PointerType id="_651" type="_693" size="32" align="32"/>
  <PointerType id="_652" type="_694" size="32" align="32"/>
  <PointerType id="_653" type="_695" size="32" align="32"/>
  <PointerType id="_654" type="_696" size="32" align="32"/>
  <PointerType id="_655" type="_697" size="32" align="32"/>
  <ReferenceType id="_656" type="_19" size="32" align="32"/>
  <ReferenceType id="_657" type="_19c" size="32" align="32"/>
  <ArrayType id="_658" min="0" max="0u" type="_526" size="32" align="32"/>
  <ReferenceType id="_659" type="_62" size="32" align="32"/>
  <ReferenceType id="_660" type="_62c" size="32" align="32"/>
  <PointerType id="_663" type="_322c" size="32" align="32"/>
  <ReferenceType id="_664" type="_171" size="32" align="32"/>
  <ReferenceType id="_665" type="_171c" size="32" align="32"/>
  <ReferenceType id="_667" type="_190" size="32" align="32"/>
  <ReferenceType id="_668" type="_190c" size="32" align="32"/>
  <ReferenceType id="_669" type="_269" size="32" align="32"/>
  <ReferenceType id="_670" type="_269c" size="32" align="32"/>
  <PointerType id="_672" type="_704" size="32" align="32"/>
  <PointerType id="_673" type="_705" size="32" align="32"/>
  <PointerType id="_674" type="_706" size="32" align="32"/>
  <PointerType id="_675" type="_707" size="32" align="32"/>
  <PointerType id="_676" type="_708" size="32" align="32"/>
  <PointerType id="_677" type="_709" size="32" align="32"/>
  <ReferenceType id="_678" type="_321" size="32" align="32"/>
  <ReferenceType id="_679" type="_321c" size="32" align="32"/>
  <PointerType id="_681" type="_711" size="32" align="32"/>
  <PointerType id="_682" type="_712" size="32" align="32"/>
  <PointerType id="_683" type="_713" size="32" align="32"/>
  <ReferenceType id="_684" type="_335" size="32" align="32"/>
  <ReferenceType id="_685" type="_335c" size="32" align="32"/>
  <ReferenceType id="_686" type="_437" size="32" align="32"/>
  <ReferenceType id="_687" type="_437c" size="32" align="32"/>
  <FundamentalType id="_644" name="char" size="8" align="8"/>
  <CvQualifiedType id="_644c" type="_644" const="1"/>
  <CvQualifiedType id="_543c" type="_543" const="1"/>
