<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

    <Argument name="remember_me" type="_496" location="f0:772" file="f0" line="772"/>
    <Argument name="blob" type="_498" location="f0:772" file="f0" line="772"/>
  </Function>
  <Function id="_473" name="sp_search_add_ref" returns="_445" context="_1" location="f0:2715" file="f0" line="2715" extern="1">
    <Argument name="search" type="_548" location="f0:2715" file="f0" line="2715"/>
  </Function>
  <Function id="_474" name="sp_search_total_tracks" returns="_60" context="_1" location="f0:2673" file="f0" line="2673" extern="1">
    <Argument name="search" type="_548" location="f0:2673" file="f0" line="2673"/>
  </Function>
  <Function id="_475" name="sp_playlistcontainer_remove_callbacks" returns="_445" context="_1" location="f0:3405" file="f0" line="3405" extern="1">
    <Argument name="pc" type="_526" location="f0:3405" file="f0" line="3405"/>
    <Argument name="callbacks" type="_595" location="f0:3405" file="f0" line="3405"/>
    <Argument name="userdata" type="_543" location="f0:3405" file="f0" line="3405"/>
  </Function>
  <Function id="_476" name="sp_playlist_num_subscribers" returns="_197" context="_1" location="f0:3167" file="f0" line="3167" extern="1">
    <Argument name="playlist" type="_495" location="f0:3167" file="f0" line="3167"/>
  </Function>
  <Function id="_477" name="sp_playlist_has_pending_changes" returns="_496" context="_1" location="f0:3108" file="f0" line="3108" extern="1">
    <Argument name="playlist" type="_495" location="f0:3108" file="f0" line="3108"/>
  </Function>
  <Function id="_478" name="sp_artistbrowse_backend_request_duration" returns="_60" context="_1" location="f0:2308" file="f0" line="2308" extern="1">
    <Argument name="arb" type="_539" location="f0:2308" file="f0" line="2308"/>
  </Function>
  <Function id="_479" name="sp_playlist_get_offline_download_completed" returns="_60" context="_1" location="f0:3301" file="f0" line="3301" extern="1">
    <Argument name="session" type="_522" location="f0:3301" file="f0" line="3301"/>
    <Argument name="playlist" type="_495" location="f0:3301" file="f0" line="3301"/>
  </Function>
  <Function id="_480" name="sp_artist_release" returns="_445" context="_1" location="f0:1940" file="f0" line="1940" extern="1">
    <Argument name="artist" type="_525" location="f0:1940" file="f0" line="1940"/>
  </Function>
  <Function id="_481" name="__builtin_bswap32" returns="_197" context="_1" location="f1:134" file="f1" line="134" extern="1">
    <Argument name="_data" type="_197" location="f1:134" file="f1" line="134"/>
  </Function>
  <Typedef id="_482" name="uint_least8_t" type="_378" context="_1" location="f2:204" file="f2" line="204"/>
  <Enumeration id="_483" name="sp_image_size" context="_1" location="f0:261" file="f0" line="261" artificial="1" size="32" align="32">
    <EnumValue name="SP_IMAGE_SIZE_NORMAL" init="0"/>
    <EnumValue name="SP_IMAGE_SIZE_SMALL" init="1"/>
    <EnumValue name="SP_IMAGE_SIZE_LARGE" init="2"/>
  </Enumeration>
  <Typedef id="_484" name="sp_image_size" type="_483" context="_1" location="f0:265" file="f0" line="265"/>
  <Function id="_485" name="sp_image_release" returns="_445" context="_1" location="f0:2474" file="f0" line="2474" extern="1">
    <Argument name="image" type="_530" location="f0:2474" file="f0" line="2474"/>
  </Function>
  <Function id="_486" name="sp_artistbrowse_tophit_track" returns="_501" context="_1" location="f0:2244" file="f0" line="2244" extern="1">
    <Argument name="arb" type="_539" location="f0:2244" file="f0" line="2244"/>
    <Argument name="index" type="_60" location="f0:2244" file="f0" line="2244"/>
  </Function>
  <Function id="_487" name="sp_session_release" returns="_445" context="_1" location="f0:748" file="f0" line="748" extern="1">
    <Argument name="sess" type="_522" location="f0:748" file="f0" line="748"/>
  </Function>
  <Function id="_488" name="__builtin_sinf" returns="_499" context="_1" mangled="sinf" location="f1:76" file="f1" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_499" location="f1:76" file="f1" line="76"/>
  </Function>
  <Function id="_489" name="__builtin_sinh" returns="_497" context="_1" mangled="sinh" location="f1:77" file="f1" line="77" extern="1" attributes="nothrow pure no vops">
    <Argument type="_497" location="f1:77" file="f1" line="77"/>
  </Function>
  <Function id="_490" name="__builtin_sinl" returns="_500" context="_1" mangled="sinl" location="f1:80" file="f1" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_500" location="f1:80" file="f1" line="80"/>
  </Function>
  <Typedef id="_491" name="uint64_t" type="_7" context="_1" location="f2:69" file="f2" line="69"/>
  <Function id="_492" name="__builtin_csin" returns="_529" context="_1" mangled="csin" location="f1:115" file="f1" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_529" location="f1:115" file="f1" line="115"/>
  </Function>
  <Function id="_493" name="sp_toplistbrowse_error" returns="_445" context="_1" location="f0:3765" file="f0" line="3765" extern="1">
    <Argument name="tlb" type="_521" location="f0:3765" file="f0" line="3765"/>
  </Function>
  <Function id="_494" name="sp_track_is_local" returns="_496" context="_1" location="f0:1584" file="f0" line="1584" extern="1">
    <Argument name="session" type="_522" location="f0:1584" file="f0" line="1584"/>
    <Argument name="track" type="_501" location="f0:1584" file="f0" line="1584"/>
  </Function>
  <PointerType id="_495" type="_403" size="32" align="32"/>
  <FundamentalType id="_496" name="bool" size="8" align="8"/>
  <FundamentalType id="_497" name="double" size="64" align="64"/>
  <PointerType id="_498" type="_647c" size="32" align="32"/>
  <FundamentalType id="_499" name="float" size="32" align="32"/>
  <FundamentalType id="_500" name="long double" size="128" align="128"/>
  <PointerType id="_501" type="_55" size="32" align="32"/>
  <FundamentalType id="_502" name="complex float" size="64" align="32"/>
  <FundamentalType id="_503" name="complex long double" size="256" align="128"/>
  <Field id="_504" name="tracks_added" type="_649" offset="0" context="_19" access="public" location="f0:2760" file="f0" line="2760"/>
  <Field id="_505" name="tracks_removed" type="_650" offset="32" context="_19" access="public" location="f0:2770" file="f0" line="2770"/>
  <Field id="_506" name="tracks_moved" type="_651" offset="64" context="_19" access="public" location="f0:2781" file="f0" line="2781"/>
  <Field id="_507" name="playlist_renamed" type="_652" offset="96" context="_19" access="public" location="f0:2789" file="f0" line="2789"/>
  <Field id="_508" name="playlist_state_changed" type="_652" offset="128" context="_19" access="public" location="f0:2805" file="f0" line="2805"/>
  <Field id="_509" name="playlist_update_in_progress" type="_653" offset="160" context="_19" access="public" location="f0:2818" file="f0" line="2818"/>
  <Field id="_510" name="playlist_metadata_updated" type="_652" offset="192" context="_19" access="public" location="f0:2826" file="f0" line="2826"/>
  <Field id="_511" name="track_created_changed" type="_654" offset="224" context="_19" access="public" location="f0:2837" file="f0" line="2837"/>
  <Field id="_512" name="track_seen_changed" type="_655" offset="256" context="_19" access="public" location="f0:2847" file="f0" line="2847"/>
  <Field id="_513" name="description_changed" type="_656" offset="288" context="_19" access="public" location="f0:2856" file="f0" line="2856"/>
  <Field id="_514" name="image_changed" type="_657" offset="320" context="_19" access="public" location="f0:2866" file="f0" line="2866"/>
  <Field id="_515" name="track_message_changed" type="_658" offset="352" context="_19" access="public" location="f0:2877" file="f0" line="2877"/>
  <Field id="_516" name="subscribers_changed" type="_652" offset="384" context="_19" access="public" location="f0:2886" file="f0" line="2886"/>
  <Destructor id="_517" name="sp_playlist_callbacks" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksD1Ev *INTERNAL* " demangled="sp_playlist_callbacks::~sp_playlist_callbacks()" location="f0:2749" file="f0" line="2749" endline="2749" inline="1">
  </Destructor>
  <OperatorMethod id="_518" name="=" returns="_659" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksaSERKS_" demangled="sp_playlist_callbacks::operator=(sp_playlist_callbacks const&amp;)" location="f0:2749" file="f0" line="2749" endline="2749" inline="1">
    <Argument type="_660" location="f0:2749" file="f0" line="2749"/>
  </OperatorMethod>
  <Constructor id="_519" name="sp_playlist_callbacks" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksC1ERKS_ *INTERNAL* " demangled="sp_playlist_callbacks::sp_playlist_callbacks(sp_playlist_callbacks const&amp;)" location="f0:2749" file="f0" line="2749" endline="2749" inline="1">
    <Argument type="_660" location="f0:2749" file="f0" line="2749"/>
  </Constructor>
  <Constructor id="_520" name="sp_playlist_callbacks" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksC1Ev *INTERNAL* " demangled="sp_playlist_callbacks::sp_playlist_callbacks()" location="f0:2749" file="f0" line="2749" inline="1"/>
  <PointerType id="_521" type="_100" size="32" align="32"/>
  <PointerType id="_522" type="_230" size="32" align="32"/>
  <PointerType id="_523" type="_76" size="32" align="32"/>
  <PointerType id="_524" type="_124" size="32" align="32"/>
  <PointerType id="_525" type="_70" size="32" align="32"/>
  <PointerType id="_526" type="_140" size="32" align="32"/>
  <PointerType id="_527" type="_501" size="32" align="32"/>
  <PointerType id="_528" type="_647" size="32" align="32"/>
  <FundamentalType id="_529" name="complex double" size="128" align="64"/>
  <PointerType id="_530" type="_79" size="32" align="32"/>
  <PointerType id="_531" type="_334" size="32" align="32"/>
  <Field id="_532" name="count" type="_197" offset="0" context="_62" access="public" location="f0:279" file="f0" line="279"/>
  <Field id="_533" name="subscribers" type="_661" offset="32" context="_62" access="public" location="f0:280" file="f0" line="280"/>
  <Destructor id="_534" name="sp_subscribers" artificial="1" throw="" context="_62" access="public" mangled="_ZN14sp_subscribersD1Ev *INTERNAL* " demangled="sp_subscribers::~sp_subscribers()" location="f0:278" file="f0" line="278" endline="278" inline="1">
  </Destructor>
  <OperatorMethod id="_535" name="=" returns="_662" artificial="1" throw="" context="_62" access="public" mangled="_ZN14sp_subscribersaSERKS_" demangled="sp_subscribers::operator=(sp_subscribers const&amp;)" location="f0:278" file="f0" line="278" endline="278" inline="1">
    <Argument type="_663" location="f0:278" file="f0" line="278"/>
  </OperatorMethod>
  <Constructor id="_536" name="sp_subscribers" artificial="1" throw="" context="_62" access="public" mangled="_ZN14sp_subscribersC1ERKS_ *INTERNAL* " demangled="sp_subscribers::sp_subscribers(sp_subscribers const&amp;)" location="f0:278" file="f0" line="278" endline="278" inline="1">
    <Argument type="_663" location="f0:278" file="f0" line="278"/>
  </Constructor>
  <Constructor id="_537" name="sp_subscribers" artificial="1" throw="" context="_62" access="public" mangled="_ZN14sp_subscribersC1Ev *INTERNAL* " demangled="sp_subscribers::sp_subscribers()" location="f0:278" file="f0" line="278" inline="1"/>
  <PointerType id="_538" type="_418" size="32" align="32"/>
  <PointerType id="_539" type="_222" size="32" align="32"/>
  <PointerType id="_540" type="_389" size="32" align="32"/>
  <PointerType id="_541" type="_501c" size="32" align="32"/>
  <PointerType id="_542" type="_451" size="32" align="32"/>
  <PointerType id="_543" type="_545" size="32" align="32"/>
  <PointerType id="_544" type="_247" size="32" align="32"/>
  <FundamentalType id="_545" name="void" align="8"/>
  <PointerType id="_546" type="_153" size="32" align="32"/>
  <PointerType id="_547" type="_418c" size="32" align="32"/>
  <PointerType id="_548" type="_219" size="32" align="32"/>
  <PointerType id="_549" type="_470" size="32" align="32"/>
  <PointerType id="_550" type="_60" size="32" align="32"/>
  <Field id="_551" name="api_version" type="_60" offset="0" context="_173" access="public" location="f0:644" file="f0" line="644"/>
  <Field id="_552" name="cache_location" type="_498" offset="32" context="_173" access="public" location="f0:645" file="f0" line="645"/>
  <Field id="_553" name="settings_location" type="_498" offset="64" context="_173" access="public" location="f0:649" file="f0" line="649"/>
  <Field id="_554" name="application_key" type="_576" offset="96" context="_173" access="public" location="f0:655" file="f0" line="655"/>
  <Field id="_555" name="application_key_size" type="_309" offset="128" context="_173" access="public" location="f0:656" file="f0" line="656"/>
  <Field id="_556" name="user_agent" type="_498" offset="160" context="_173" access="public" location="f0:657" file="f0" line="657"/>
  <Field id="_557" name="callbacks" type="_666" offset="192" context="_173" access="public" location="f0:661" file="f0" line="661"/>
  <Field id="_558" name="userdata" type="_543" offset="224" context="_173" access="public" location="f0:662" file="f0" line="662"/>
  <Field id="_559" name="compress_playlists" type="_496" offset="256" context="_173" access="public" location="f0:667" file="f0" line="667"/>
  <Field id="_560" name="dont_save_metadata_for_playlists" type="_496" offset="264" context="_173" access="public" location="f0:674" file="f0" line="674"/>
  <Field id="_561" name="initially_unload_playlists" type="_496" offset="272" context="_173" access="public" location="f0:680" file="f0" line="680"/>
  <Field id="_562" name="device_id" type="_498" offset="288" context="_173" access="public" location="f0:687" file="f0" line="687"/>
  <Field id="_563" name="proxy" type="_498" offset="320" context="_173" access="public" location="f0:693" file="f0" line="693"/>
  <Field id="_564" name="proxy_username" type="_498" offset="352" context="_173" access="public" location="f0:697" file="f0" line="697"/>
  <Field id="_565" name="proxy_password" type="_498" offset="384" context="_173" access="public" location="f0:701" file="f0" line="701"/>
  <Field id="_566" name="ca_certs_filename" type="_498" offset="416" context="_173" access="public" location="f0:709" file="f0" line="709"/>
  <Field id="_567" name="tracefile" type="_498" offset="448" context="_173" access="public" location="f0:714" file="f0" line="714"/>
  <Destructor id="_568" name="sp_session_config" artificial="1" throw="" context="_173" access="public" mangled="_ZN17sp_session_configD1Ev *INTERNAL* " demangled="sp_session_config::~sp_session_config()" location="f0:643" file="f0" line="643" endline="643" inline="1">
  </Destructor>
  <OperatorMethod id="_569" name="=" returns="_667" artificial="1" throw="" context="_173" access="public" mangled="_ZN17sp_session_configaSERKS_" demangled="sp_session_config::operator=(sp_session_config const&amp;)" location="f0:643" file="f0" line="643" endline="643" inline="1">
    <Argument type="_668" location="f0:643" file="f0" line="643"/>
  </OperatorMethod>
  <Constructor id="_570" name="sp_session_config" artificial="1" throw="" context="_173" access="public" mangled="_ZN17sp_session_configC1ERKS_ *INTERNAL* " demangled="sp_session_config::sp_session_config(sp_session_config const&amp;)" location="f0:643" file="f0" line="643" endline="643" inline="1">
    <Argument type="_668" location="f0:643" file="f0" line="643"/>
  </Constructor>
  <Constructor id="_571" name="sp_session_config" artificial="1" throw="" context="_173" access="public" mangled="_ZN17sp_session_configC1Ev *INTERNAL* " demangled="sp_session_config::sp_session_config()" location="f0:643" file="f0" line="643" inline="1"/>
  <PointerType id="_572" type="_412" size="32" align="32"/>
  <PointerType id="_573" type="_20" size="32" align="32"/>
  <PointerType id="_574" type="_499" size="32" align="32"/>
  <PointerType id="_575" type="_500" size="32" align="32"/>
  <PointerType id="_576" type="_545c" size="32" align="32"/>
  <Field id="_577" name="samples" type="_60" offset="0" context="_193" access="public" location="f0:271" file="f0" line="271"/>
  <Field id="_578" name="stutter" type="_60" offset="32" context="_193" access="public" location="f0:272" file="f0" line="272"/>
  <Destructor id="_579" name="sp_audio_buffer_stats" artificial="1" throw="" context="_193" access="public" mangled="_ZN21sp_audio_buffer_statsD1Ev *INTERNAL* " demangled="sp_audio_buffer_stats::~sp_audio_buffer_stats()" location="f0:270" file="f0" line="270" endline="270" inline="1">
  </Destructor>
  <OperatorMethod id="_580" name="=" returns="_670" artificial="1" throw="" context="_193" access="public" mangled="_ZN21sp_audio_buffer_statsaSERKS_" demangled="sp_audio_buffer_stats::operator=(sp_audio_buffer_stats const&amp;)" location="f0:270" file="f0" line="270" endline="270" inline="1">
    <Argument type="_671" location="f0:270" file="f0" line="270"/>
  </OperatorMethod>
  <Constructor id="_581" name="sp_audio_buffer_stats" artificial="1" throw="" context="_193" access="public" mangled="_ZN21sp_audio_buffer_statsC1ERKS_ *INTERNAL* " demangled="sp_audio_buffer_stats::sp_audio_buffer_stats(sp_audio_buffer_stats const&amp;)" location="f0:270" file="f0" line="270" endline="270" inline="1">
    <Argument type="_671" location="f0:270" file="f0" line="270"/>
  </Constructor>
  <Constructor id="_582" name="sp_audio_buffer_stats" artificial="1" throw="" context="_193" access="public" mangled="_ZN21sp_audio_buffer_statsC1Ev *INTERNAL* " demangled="sp_audio_buffer_stats::sp_audio_buffer_stats()" location="f0:270" file="f0" line="270" inline="1"/>
  <PointerType id="_583" type="_309" size="32" align="32"/>
  <PointerType id="_584" type="_256" size="32" align="32"/>
  <Field id="_585" name="sample_type" type="_396" offset="0" context="_271" access="public" location="f0:190" file="f0" line="190"/>
  <Field id="_586" name="sample_rate" type="_60" offset="32" context="_271" access="public" location="f0:191" file="f0" line="191"/>
  <Field id="_587" name="channels" type="_60" offset="64" context="_271" access="public" location="f0:192" file="f0" line="192"/>
  <Destructor id="_588" name="sp_audioformat" artificial="1" throw="" context="_271" access="public" mangled="_ZN14sp_audioformatD1Ev *INTERNAL* " demangled="sp_audioformat::~sp_audioformat()" location="f0:189" file="f0" line="189" endline="189" inline="1">
  </Destructor>
  <OperatorMethod id="_589" name="=" returns="_672" artificial="1" throw="" context="_271" access="public" mangled="_ZN14sp_audioformataSERKS_" demangled="sp_audioformat::operator=(sp_audioformat const&amp;)" location="f0:189" file="f0" line="189" endline="189" inline="1">
    <Argument type="_673" location="f0:189" file="f0" line="189"/>
  </OperatorMethod>
  <Constructor id="_590" name="sp_audioformat" artificial="1" throw="" context="_271" access="public" mangled="_ZN14sp_audioformatC1ERKS_ *INTERNAL* " demangled="sp_audioformat::sp_audioformat(sp_audioformat const&amp;)" location="f0:189" file="f0" line="189" endline="189" inline="1">
    <Argument type="_673" location="f0:189" file="f0" line="189"/>
  </Constructor>
  <Constructor id="_591" name="sp_audioformat" artificial="1" throw="" context="_271" access="public" mangled="_ZN14sp_audioformatC1Ev *INTERNAL* " demangled="sp_audioformat::sp_audioformat()" location="f0:189" file="f0" line="189" inline="1"/>
  <PointerType id="_592" type="_174c" size="32" align="32"/>
  <PointerType id="_593" type="_522" size="32" align="32"/>
  <PointerType id="_594" type="_129" size="32" align="32"/>
  <PointerType id="_595" type="_339" size="32" align="32"/>
  <Field id="_596" name="logged_in" type="_675" offset="0" context="_325" access="public" location="f0:409" file="f0" line="409"/>
  <Field id="_597" name="logged_out" type="_676" offset="32" context="_325" access="public" location="f0:418" file="f0" line="418"/>
  <Field id="_598" name="metadata_updated" type="_676" offset="64" context="_325" access="public" location="f0:427" file="f0" line="427"/>
  <Field id="_599" name="connection_error" type="_675" offset="96" context="_325" access="public" location="f0:446" file="f0" line="446"/>
  <Field id="_600" name="message_to_user" type="_677" offset="128" context="_325" access="public" location="f0:457" file="f0" line="457"/>
  <Field id="_601" name="notify_main_thread" type="_676" offset="160" context="_325" access="public" location="f0:470" file="f0" line="470"/>
  <Field id="_602" name="music_delivery" type="_678" offset="192" context="_325" access="public" location="f0:491" file="f0" line="491"/>
  <Field id="_603" name="play_token_lost" type="_676" offset="224" context="_325" access="public" location="f0:509" file="f0" line="509"/>
  <Field id="_604" name="log_message" type="_677" offset="256" context="_325" access="public" location="f0:517" file="f0" line="517"/>
  <Field id="_605" name="end_of_track" type="_676" offset="288" context="_325" access="public" location="f0:527" file="f0" line="527"/>
  <Field id="_606" name="streaming_error" type="_675" offset="320" context="_325" access="public" location="f0:541" file="f0" line="541"/>
  <Field id="_607" name="userinfo_updated" type="_676" offset="352" context="_325" access="public" location="f0:548" file="f0" line="548"/>
  <Field id="_608" name="start_playback" type="_676" offset="384" context="_325" access="public" location="f0:561" file="f0" line="561"/>
  <Field id="_609" name="stop_playback" type="_676" offset="416" context="_325" access="public" location="f0:575" file="f0" line="575"/>
  <Field id="_610" name="get_audio_buffer_stats" type="_679" offset="448" context="_325" access="public" location="f0:587" file="f0" line="587"/>
  <Field id="_611" name="offline_status_updated" type="_676" offset="480" context="_325" access="public" location="f0:594" file="f0" line="594"/>
  <Field id="_612" name="offline_error" type="_675" offset="512" context="_325" access="public" location="f0:603" file="f0" line="603"/>
  <Field id="_613" name="credentials_blob_updated" type="_677" offset="544" context="_325" access="public" location="f0:614" file="f0" line="614"/>
  <Field id="_614" name="connectionstate_updated" type="_676" offset="576" context="_325" access="public" location="f0:621" file="f0" line="621"/>
  <Field id="_615" name="scrobble_error" type="_675" offset="608" context="_325" access="public" location="f0:629" file="f0" line="629"/>
  <Field id="_616" name="private_session_mode_changed" type="_680" offset="640" context="_325" access="public" location="f0:637" file="f0" line="637"/>
  <Destructor id="_617" name="sp_session_callbacks" artificial="1" throw="" context="_325" access="public" mangled="_ZN20sp_session_callbacksD1Ev *INTERNAL* " demangled="sp_session_callbacks::~sp_session_callbacks()" location="f0:393" file="f0" line="393" endline="393" inline="1">
  </Destructor>
  <OperatorMethod id="_618" name="=" returns="_681" artificial="1" throw="" context="_325" access="public" mangled="_ZN20sp_session_callbacksaSERKS_" demangled="sp_session_callbacks::operator=(sp_session_callbacks const&amp;)" location="f0:393" file="f0" line="393" endline="393" inline="1">
    <Argument type="_682" location="f0:393" file="f0" line="393"/>
  </OperatorMethod>
  <Constructor id="_619" name="sp_session_callbacks" artificial="1" throw="" context="_325" access="public" mangled="_ZN20sp_session_callbacksC1ERKS_ *INTERNAL* " demangled="sp_session_callbacks::sp_session_callbacks(sp_session_callbacks const&amp;)" location="f0:393" file="f0" line="393" endline="393" inline="1">
    <Argument type="_682" location="f0:393" file="f0" line="393"/>
  </Constructor>
  <Constructor id="_620" name="sp_session_callbacks" artificial="1" throw="" context="_325" access="public" mangled="_ZN20sp_session_callbacksC1Ev *INTERNAL* " demangled="sp_session_callbacks::sp_session_callbacks()" location="f0:393" file="f0" line="393" inline="1"/>
  <PointerType id="_621" type="_60c" size="32" align="32"/>
  <Field id="_622" name="playlist_added" type="_684" offset="0" context="_338" access="public" location="f0:3338" file="f0" line="3338"/>
  <Field id="_623" name="playlist_removed" type="_684" offset="32" context="_338" access="public" location="f0:3349" file="f0" line="3349"/>
  <Field id="_624" name="playlist_moved" type="_685" offset="64" context="_338" access="public" location="f0:3361" file="f0" line="3361"/>
  <Field id="_625" name="container_loaded" type="_686" offset="96" context="_338" access="public" location="f0:3369" file="f0" line="3369"/>
  <Destructor id="_626" name="sp_playlistcontainer_callbacks" artificial="1" throw="" context="_338" access="public" mangled="_ZN30sp_playlistcontainer_callbacksD1Ev *INTERNAL* " demangled="sp_playlistcontainer_callbacks::~sp_playlistcontainer_callbacks()" location="f0:3329" file="f0" line="3329" endline="3329" inline="1">
  </Destructor>
  <OperatorMethod id="_627" name="=" returns="_687" artificial="1" throw="" context="_338" access="public" mangled="_ZN30sp_playlistcontainer_callbacksaSERKS_" demangled="sp_playlistcontainer_callbacks::operator=(sp_playlistcontainer_callbacks const&amp;)" location="f0:3329" file="f0" line="3329" endline="3329" inline="1">
    <Argument type="_688" location="f0:3329" file="f0" line="3329"/>
  </OperatorMethod>
  <Constructor id="_628" name="sp_playlistcontainer_callbacks" artificial="1" throw="" context="_338" access="public" mangled="_ZN30sp_playlistcontainer_callbacksC1ERKS_ *INTERNAL* " demangled="sp_playlistcontainer_callbacks::sp_playlistcontainer_callbacks(sp_playlistcontainer_callbacks const&amp;)" location="f0:3329" file="f0" line="3329" endline="3329" inline="1">
    <Argument type="_688" location="f0:3329" file="f0" line="3329"/>
  </Constructor>
  <Constructor id="_629" name="sp_playlistcontainer_callbacks" artificial="1" throw="" context="_338" access="public" mangled="_ZN30sp_playlistcontainer_callbacksC1Ev *INTERNAL* " demangled="sp_playlistcontainer_callbacks::sp_playlistcontainer_callbacks()" location="f0:3329" file="f0" line="3329" inline="1"/>
  <PointerType id="_630" type="_168" size="32" align="32"/>
  <PointerType id="_631" type="_63" size="32" align="32"/>
  <PointerType id="_632" type="_439" size="32" align="32"/>
  <PointerType id="_633" type="_496" size="32" align="32"/>
  <Field id="_634" name="queued_tracks" type="_60" offset="0" context="_438" access="public" location="f0:350" file="f0" line="350"/>
  <Field id="_635" name="queued_bytes" type="_8" offset="32" context="_438" access="public" location="f0:351" file="f0" line="351"/>
  <Field id="_636" name="done_tracks" type="_60" offset="96" context="_438" access="public" location="f0:357" file="f0" line="357"/>
  <Field id="_637" name="done_bytes" type="_8" offset="128" context="_438" access="public" location="f0:358" file="f0" line="358"/>
  <Field id="_638" name="copied_tracks" type="_60" offset="192" context="_438" access="public" location="f0:364" file="f0" line="364"/>
  <Field id="_639" name="copied_bytes" type="_8" offset="224" context="_438" access="public" location="f0:365" file="f0" line="365"/>
  <Field id="_640" name="willnotcopy_tracks" type="_60" offset="288" context="_438" access="public" location="f0:371" file="f0" line="371"/>
  <Field id="_641" name="error_tracks" type="_60" offset="320" context="_438" access="public" location="f0:377" file="f0" line="377"/>
  <Field id="_642" name="syncing" type="_496" offset="352" context="_438" access="public" location="f0:382" file="f0" line="382"/>
  <Destructor id="_643" name="sp_offline_sync_status" artificial="1" throw="" context="_438" access="public" mangled="_ZN22sp_offline_sync_statusD1Ev *INTERNAL* " demangled="sp_offline_sync_status::~sp_offline_sync_status()" location="f0:345" file="f0" line="345" endline="345" inline="1">
  </Destructor>
  <OperatorMethod id="_644" name="=" returns="_689" artificial="1" throw="" context="_438" access="public" mangled="_ZN22sp_offline_sync_statusaSERKS_" demangled="sp_offline_sync_status::operator=(sp_offline_sync_status const&amp;)" location="f0:345" file="f0" line="345" endline="345" inline="1">
    <Argument type="_690" location="f0:345" file="f0" line="345"/>
  </OperatorMethod>
  <Constructor id="_645" name="sp_offline_sync_status" artificial="1" throw="" context="_438" access="public" mangled="_ZN22sp_offline_sync_statusC1ERKS_ *INTERNAL* " demangled="sp_offline_sync_status::sp_offline_sync_status(sp_offline_sync_status const&amp;)" location="f0:345" file="f0" line="345" endline="345" inline="1">
    <Argument type="_690" location="f0:345" file="f0" line="345"/>
  </Constructor>
  <Constructor id="_646" name="sp_offline_sync_status" artificial="1" throw="" context="_438" access="public" mangled="_ZN22sp_offline_sync_statusC1Ev *INTERNAL* " demangled="sp_offline_sync_status::sp_offline_sync_status()" location="f0:345" file="f0" line="345" inline="1"/>
  <PointerType id="_649" type="_691" size="32" align="32"/>
  <PointerType id="_650" type="_692" size="32" align="32"/>
  <PointerType id="_651" type="_693" size="32" align="32"/>
  <PointerType id="_652" type="_694" size="32" align="32"/>
  <PointerType id="_653" type="_695" size="32" align="32"/>
  <PointerType id="_654" type="_696" size="32" align="32"/>
  <PointerType id="_655" type="_697" size="32" align="32"/>
  <PointerType id="_656" type="_698" size="32" align="32"/>
  <PointerType id="_657" type="_699" size="32" align="32"/>
  <PointerType id="_658" type="_700" size="32" align="32"/>
  <ReferenceType id="_659" type="_19" size="32" align="32"/>
  <ReferenceType id="_660" type="_19c" size="32" align="32"/>
  <ArrayType id="_661" min="0" max="0u" type="_528" size="32" align="32"/>
  <ReferenceType id="_662" type="_62" size="32" align="32"/>
  <ReferenceType id="_663" type="_62c" size="32" align="32"/>
  <PointerType id="_666" type="_326c" size="32" align="32"/>
  <ReferenceType id="_667" type="_173" size="32" align="32"/>
  <ReferenceType id="_668" type="_173c" size="32" align="32"/>
  <ReferenceType id="_670" type="_193" size="32" align="32"/>
  <ReferenceType id="_671" type="_193c" size="32" align="32"/>
  <ReferenceType id="_672" type="_271" size="32" align="32"/>
  <ReferenceType id="_673" type="_271c" size="32" align="32"/>
  <PointerType id="_675" type="_707" size="32" align="32"/>
  <PointerType id="_676" type="_708" size="32" align="32"/>
  <PointerType id="_677" type="_709" size="32" align="32"/>
  <PointerType id="_678" type="_710" size="32" align="32"/>
  <PointerType id="_679" type="_711" size="32" align="32"/>
  <PointerType id="_680" type="_712" size="32" align="32"/>
  <ReferenceType id="_681" type="_325" size="32" align="32"/>
  <ReferenceType id="_682" type="_325c" size="32" align="32"/>
  <PointerType id="_684" type="_714" size="32" align="32"/>
  <PointerType id="_685" type="_715" size="32" align="32"/>
  <PointerType id="_686" type="_716" size="32" align="32"/>
  <ReferenceType id="_687" type="_338" size="32" align="32"/>
  <ReferenceType id="_688" type="_338c" size="32" align="32"/>
  <ReferenceType id="_689" type="_438" size="32" align="32"/>
  <ReferenceType id="_690" type="_438c" size="32" align="32"/>
  <FundamentalType id="_647" name="char" size="8" align="8"/>
  <CvQualifiedType id="_647c" type="_647" const="1"/>
  <CvQualifiedType id="_545c" type="_545" const="1"/>
