<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

    <Argument type="_477" location="f1:44" file="f1" line="44"/>
  </Function>
  <FunctionType id="_449" returns="_471">
    <Argument type="_520"/>
    <Argument type="_519"/>
  </FunctionType>
  <Typedef id="_450" name="albumbrowse_complete_cb" type="_449" context="_1" location="f0:1697" file="f0" line="1697"/>
  <Function id="_451" name="sp_session_remembered_user" returns="_58" context="_1" location="f0:694" file="f0" line="694" extern="1">
    <Argument name="session" type="_502" location="f0:694" file="f0" line="694"/>
    <Argument name="buffer" type="_504" location="f0:694" file="f0" line="694"/>
    <Argument name="buffer_size" type="_294" location="f0:694" file="f0" line="694"/>
  </Function>
  <Function id="_452" name="sp_session_login" returns="_471" context="_1" location="f0:665" file="f0" line="665" extern="1">
    <Argument name="session" type="_502" location="f0:665" file="f0" line="665"/>
    <Argument name="username" type="_475" location="f0:665" file="f0" line="665"/>
    <Argument name="password" type="_475" location="f0:665" file="f0" line="665"/>
    <Argument name="remember_me" type="_473" location="f0:665" file="f0" line="665"/>
  </Function>
  <Function id="_453" name="sp_search_add_ref" returns="_471" context="_1" location="f0:2386" file="f0" line="2386" extern="1">
    <Argument name="search" type="_523" location="f0:2386" file="f0" line="2386"/>
  </Function>
  <Function id="_454" name="sp_search_total_tracks" returns="_58" context="_1" location="f0:2357" file="f0" line="2357" extern="1">
    <Argument name="search" type="_523" location="f0:2357" file="f0" line="2357"/>
  </Function>
  <Function id="_455" name="sp_playlistcontainer_remove_callbacks" returns="_471" context="_1" location="f0:3053" file="f0" line="3053" extern="1">
    <Argument name="pc" type="_503" location="f0:3053" file="f0" line="3053"/>
    <Argument name="callbacks" type="_565" location="f0:3053" file="f0" line="3053"/>
    <Argument name="userdata" type="_519" location="f0:3053" file="f0" line="3053"/>
  </Function>
  <Function id="_456" name="sp_playlist_num_subscribers" returns="_187" context="_1" location="f0:2831" file="f0" line="2831" extern="1">
    <Argument name="playlist" type="_472" location="f0:2831" file="f0" line="2831"/>
  </Function>
  <Function id="_457" name="sp_playlist_has_pending_changes" returns="_473" context="_1" location="f0:2772" file="f0" line="2772" extern="1">
    <Argument name="playlist" type="_472" location="f0:2772" file="f0" line="2772"/>
  </Function>
  <Function id="_458" name="sp_artistbrowse_backend_request_duration" returns="_58" context="_1" location="f0:2013" file="f0" line="2013" extern="1">
    <Argument name="arb" type="_515" location="f0:2013" file="f0" line="2013"/>
  </Function>
  <Function id="_459" name="sp_artist_release" returns="_471" context="_1" location="f0:1673" file="f0" line="1673" extern="1">
    <Argument name="artist" type="_501" location="f0:1673" file="f0" line="1673"/>
  </Function>
  <Function id="_460" name="__builtin_bswap32" returns="_187" context="_1" location="f1:134" file="f1" line="134" extern="1">
    <Argument name="_data" type="_187" location="f1:134" file="f1" line="134"/>
  </Function>
  <Typedef id="_461" name="uint_least8_t" type="_362" context="_1" location="f2:63" file="f2" line="63"/>
  <Function id="_462" name="sp_image_release" returns="_471" context="_1" location="f0:2170" file="f0" line="2170" extern="1">
    <Argument name="image" type="_506" location="f0:2170" file="f0" line="2170"/>
  </Function>
  <Function id="_463" name="sp_session_release" returns="_471" context="_1" location="f0:645" file="f0" line="645" extern="1">
    <Argument name="sess" type="_502" location="f0:645" file="f0" line="645"/>
  </Function>
  <Function id="_464" name="__builtin_sinf" returns="_476" context="_1" mangled="sinf" location="f1:76" file="f1" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_476" location="f1:76" file="f1" line="76"/>
  </Function>
  <Function id="_465" name="__builtin_sinh" returns="_474" context="_1" mangled="sinh" location="f1:77" file="f1" line="77" extern="1" attributes="nothrow pure no vops">
    <Argument type="_474" location="f1:77" file="f1" line="77"/>
  </Function>
  <Function id="_466" name="__builtin_sinl" returns="_477" context="_1" mangled="sinl" location="f1:80" file="f1" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_477" location="f1:80" file="f1" line="80"/>
  </Function>
  <Typedef id="_467" name="uint64_t" type="_7" context="_1" location="f2:55" file="f2" line="55"/>
  <Function id="_468" name="__builtin_csin" returns="_505" context="_1" mangled="csin" location="f1:115" file="f1" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_505" location="f1:115" file="f1" line="115"/>
  </Function>
  <Function id="_469" name="sp_toplistbrowse_error" returns="_426" context="_1" location="f0:3382" file="f0" line="3382" extern="1">
    <Argument name="tlb" type="_498" location="f0:3382" file="f0" line="3382"/>
  </Function>
  <Function id="_470" name="sp_track_is_local" returns="_473" context="_1" location="f0:1343" file="f0" line="1343" extern="1">
    <Argument name="session" type="_502" location="f0:1343" file="f0" line="1343"/>
    <Argument name="track" type="_478" location="f0:1343" file="f0" line="1343"/>
  </Function>
  <FundamentalType id="_471" name="void" align="8"/>
  <PointerType id="_472" type="_385" size="32" align="32"/>
  <FundamentalType id="_473" name="bool" size="8" align="8"/>
  <FundamentalType id="_474" name="double" size="64" align="64"/>
  <PointerType id="_475" type="_612c" size="32" align="32"/>
  <FundamentalType id="_476" name="float" size="32" align="32"/>
  <FundamentalType id="_477" name="long double" size="128" align="128"/>
  <PointerType id="_478" type="_53" size="32" align="32"/>
  <FundamentalType id="_479" name="complex float" size="64" align="32"/>
  <FundamentalType id="_480" name="complex long double" size="256" align="128"/>
  <Field id="_481" name="tracks_added" type="_614" offset="0" context="_19" access="public" location="f0:2428" file="f0" line="2428"/>
  <Field id="_482" name="tracks_removed" type="_615" offset="32" context="_19" access="public" location="f0:2438" file="f0" line="2438"/>
  <Field id="_483" name="tracks_moved" type="_616" offset="64" context="_19" access="public" location="f0:2449" file="f0" line="2449"/>
  <Field id="_484" name="playlist_renamed" type="_617" offset="96" context="_19" access="public" location="f0:2457" file="f0" line="2457"/>
  <Field id="_485" name="playlist_state_changed" type="_617" offset="128" context="_19" access="public" location="f0:2473" file="f0" line="2473"/>
  <Field id="_486" name="playlist_update_in_progress" type="_618" offset="160" context="_19" access="public" location="f0:2486" file="f0" line="2486"/>
  <Field id="_487" name="playlist_metadata_updated" type="_617" offset="192" context="_19" access="public" location="f0:2494" file="f0" line="2494"/>
  <Field id="_488" name="track_created_changed" type="_619" offset="224" context="_19" access="public" location="f0:2505" file="f0" line="2505"/>
  <Field id="_489" name="track_seen_changed" type="_620" offset="256" context="_19" access="public" location="f0:2515" file="f0" line="2515"/>
  <Field id="_490" name="description_changed" type="_621" offset="288" context="_19" access="public" location="f0:2524" file="f0" line="2524"/>
  <Field id="_491" name="image_changed" type="_622" offset="320" context="_19" access="public" location="f0:2534" file="f0" line="2534"/>
  <Field id="_492" name="track_message_changed" type="_623" offset="352" context="_19" access="public" location="f0:2545" file="f0" line="2545"/>
  <Field id="_493" name="subscribers_changed" type="_617" offset="384" context="_19" access="public" location="f0:2554" file="f0" line="2554"/>
  <Destructor id="_494" name="sp_playlist_callbacks" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksD1Ev *INTERNAL* " demangled="sp_playlist_callbacks::~sp_playlist_callbacks()" location="f0:2417" file="f0" line="2417" endline="2417" inline="1">
  </Destructor>
  <OperatorMethod id="_495" name="=" returns="_624" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksaSERKS_" demangled="sp_playlist_callbacks::operator=(sp_playlist_callbacks const&amp;)" location="f0:2417" file="f0" line="2417" endline="2417" inline="1">
    <Argument type="_625" location="f0:2417" file="f0" line="2417"/>
  </OperatorMethod>
  <Constructor id="_496" name="sp_playlist_callbacks" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksC1ERKS_ *INTERNAL* " demangled="sp_playlist_callbacks::sp_playlist_callbacks(sp_playlist_callbacks const&amp;)" location="f0:2417" file="f0" line="2417" endline="2417" inline="1">
    <Argument type="_625" location="f0:2417" file="f0" line="2417"/>
  </Constructor>
  <Constructor id="_497" name="sp_playlist_callbacks" artificial="1" throw="" context="_19" access="public" mangled="_ZN21sp_playlist_callbacksC1Ev *INTERNAL* " demangled="sp_playlist_callbacks::sp_playlist_callbacks()" location="f0:2417" file="f0" line="2417" inline="1"/>
  <PointerType id="_498" type="_95" size="32" align="32"/>
  <PointerType id="_499" type="_74" size="32" align="32"/>
  <PointerType id="_500" type="_119" size="32" align="32"/>
  <PointerType id="_501" type="_68" size="32" align="32"/>
  <PointerType id="_502" type="_217" size="32" align="32"/>
  <PointerType id="_503" type="_134" size="32" align="32"/>
  <PointerType id="_504" type="_612" size="32" align="32"/>
  <FundamentalType id="_505" name="complex double" size="128" align="64"/>
  <PointerType id="_506" type="_77" size="32" align="32"/>
  <PointerType id="_507" type="_318" size="32" align="32"/>
  <Field id="_508" name="count" type="_187" offset="0" context="_60" access="public" location="f0:258" file="f0" line="258"/>
  <Field id="_509" name="subscribers" type="_626" offset="32" context="_60" access="public" location="f0:259" file="f0" line="259"/>
  <Destructor id="_510" name="sp_subscribers" artificial="1" throw="" context="_60" access="public" mangled="_ZN14sp_subscribersD1Ev *INTERNAL* " demangled="sp_subscribers::~sp_subscribers()" location="f0:257" file="f0" line="257" endline="257" inline="1">
  </Destructor>
  <OperatorMethod id="_511" name="=" returns="_627" artificial="1" throw="" context="_60" access="public" mangled="_ZN14sp_subscribersaSERKS_" demangled="sp_subscribers::operator=(sp_subscribers const&amp;)" location="f0:257" file="f0" line="257" endline="257" inline="1">
    <Argument type="_628" location="f0:257" file="f0" line="257"/>
  </OperatorMethod>
  <Constructor id="_512" name="sp_subscribers" artificial="1" throw="" context="_60" access="public" mangled="_ZN14sp_subscribersC1ERKS_ *INTERNAL* " demangled="sp_subscribers::sp_subscribers(sp_subscribers const&amp;)" location="f0:257" file="f0" line="257" endline="257" inline="1">
    <Argument type="_628" location="f0:257" file="f0" line="257"/>
  </Constructor>
  <Constructor id="_513" name="sp_subscribers" artificial="1" throw="" context="_60" access="public" mangled="_ZN14sp_subscribersC1Ev *INTERNAL* " demangled="sp_subscribers::sp_subscribers()" location="f0:257" file="f0" line="257" inline="1"/>
  <PointerType id="_514" type="_400" size="32" align="32"/>
  <PointerType id="_515" type="_210" size="32" align="32"/>
  <PointerType id="_516" type="_370" size="32" align="32"/>
  <PointerType id="_517" type="_478c" size="32" align="32"/>
  <PointerType id="_518" type="_432" size="32" align="32"/>
  <PointerType id="_519" type="_471" size="32" align="32"/>
  <PointerType id="_520" type="_145" size="32" align="32"/>
  <PointerType id="_521" type="_400c" size="32" align="32"/>
  <PointerType id="_522" type="_450" size="32" align="32"/>
  <PointerType id="_523" type="_207" size="32" align="32"/>
  <PointerType id="_524" type="_58" size="32" align="32"/>
  <Field id="_525" name="api_version" type="_58" offset="0" context="_165" access="public" location="f0:567" file="f0" line="567"/>
  <Field id="_526" name="cache_location" type="_475" offset="32" context="_165" access="public" location="f0:568" file="f0" line="568"/>
  <Field id="_527" name="settings_location" type="_475" offset="64" context="_165" access="public" location="f0:572" file="f0" line="572"/>
  <Field id="_528" name="application_key" type="_546" offset="96" context="_165" access="public" location="f0:578" file="f0" line="578"/>
  <Field id="_529" name="application_key_size" type="_294" offset="128" context="_165" access="public" location="f0:579" file="f0" line="579"/>
  <Field id="_530" name="user_agent" type="_475" offset="160" context="_165" access="public" location="f0:580" file="f0" line="580"/>
  <Field id="_531" name="callbacks" type="_631" offset="192" context="_165" access="public" location="f0:584" file="f0" line="584"/>
  <Field id="_532" name="userdata" type="_519" offset="224" context="_165" access="public" location="f0:585" file="f0" line="585"/>
  <Field id="_533" name="compress_playlists" type="_473" offset="256" context="_165" access="public" location="f0:590" file="f0" line="590"/>
  <Field id="_534" name="dont_save_metadata_for_playlists" type="_473" offset="264" context="_165" access="public" location="f0:597" file="f0" line="597"/>
  <Field id="_535" name="initially_unload_playlists" type="_473" offset="272" context="_165" access="public" location="f0:603" file="f0" line="603"/>
  <Field id="_536" name="device_id" type="_475" offset="288" context="_165" access="public" location="f0:608" file="f0" line="608"/>
  <Field id="_537" name="tracefile" type="_475" offset="320" context="_165" access="public" location="f0:613" file="f0" line="613"/>
  <Destructor id="_538" name="sp_session_config" artificial="1" throw="" context="_165" access="public" mangled="_ZN17sp_session_configD1Ev *INTERNAL* " demangled="sp_session_config::~sp_session_config()" location="f0:566" file="f0" line="566" endline="566" inline="1">
  </Destructor>
  <OperatorMethod id="_539" name="=" returns="_632" artificial="1" throw="" context="_165" access="public" mangled="_ZN17sp_session_configaSERKS_" demangled="sp_session_config::operator=(sp_session_config const&amp;)" location="f0:566" file="f0" line="566" endline="566" inline="1">
    <Argument type="_633" location="f0:566" file="f0" line="566"/>
  </OperatorMethod>
  <Constructor id="_540" name="sp_session_config" artificial="1" throw="" context="_165" access="public" mangled="_ZN17sp_session_configC1ERKS_ *INTERNAL* " demangled="sp_session_config::sp_session_config(sp_session_config const&amp;)" location="f0:566" file="f0" line="566" endline="566" inline="1">
    <Argument type="_633" location="f0:566" file="f0" line="566"/>
  </Constructor>
  <Constructor id="_541" name="sp_session_config" artificial="1" throw="" context="_165" access="public" mangled="_ZN17sp_session_configC1Ev *INTERNAL* " demangled="sp_session_config::sp_session_config()" location="f0:566" file="f0" line="566" inline="1"/>
  <PointerType id="_542" type="_394" size="32" align="32"/>
  <PointerType id="_543" type="_20" size="32" align="32"/>
  <PointerType id="_544" type="_476" size="32" align="32"/>
  <PointerType id="_545" type="_477" size="32" align="32"/>
  <PointerType id="_546" type="_471c" size="32" align="32"/>
  <Field id="_547" name="samples" type="_58" offset="0" context="_183" access="public" location="f0:250" file="f0" line="250"/>
  <Field id="_548" name="stutter" type="_58" offset="32" context="_183" access="public" location="f0:251" file="f0" line="251"/>
  <Destructor id="_549" name="sp_audio_buffer_stats" artificial="1" throw="" context="_183" access="public" mangled="_ZN21sp_audio_buffer_statsD1Ev *INTERNAL* " demangled="sp_audio_buffer_stats::~sp_audio_buffer_stats()" location="f0:249" file="f0" line="249" endline="249" inline="1">
  </Destructor>
  <OperatorMethod id="_550" name="=" returns="_635" artificial="1" throw="" context="_183" access="public" mangled="_ZN21sp_audio_buffer_statsaSERKS_" demangled="sp_audio_buffer_stats::operator=(sp_audio_buffer_stats const&amp;)" location="f0:249" file="f0" line="249" endline="249" inline="1">
    <Argument type="_636" location="f0:249" file="f0" line="249"/>
  </OperatorMethod>
  <Constructor id="_551" name="sp_audio_buffer_stats" artificial="1" throw="" context="_183" access="public" mangled="_ZN21sp_audio_buffer_statsC1ERKS_ *INTERNAL* " demangled="sp_audio_buffer_stats::sp_audio_buffer_stats(sp_audio_buffer_stats const&amp;)" location="f0:249" file="f0" line="249" endline="249" inline="1">
    <Argument type="_636" location="f0:249" file="f0" line="249"/>
  </Constructor>
  <Constructor id="_552" name="sp_audio_buffer_stats" artificial="1" throw="" context="_183" access="public" mangled="_ZN21sp_audio_buffer_statsC1Ev *INTERNAL* " demangled="sp_audio_buffer_stats::sp_audio_buffer_stats()" location="f0:249" file="f0" line="249" inline="1"/>
  <PointerType id="_553" type="_294" size="32" align="32"/>
  <PointerType id="_554" type="_243" size="32" align="32"/>
  <Field id="_555" name="sample_type" type="_377" offset="0" context="_257" access="public" location="f0:188" file="f0" line="188"/>
  <Field id="_556" name="sample_rate" type="_58" offset="32" context="_257" access="public" location="f0:189" file="f0" line="189"/>
  <Field id="_557" name="channels" type="_58" offset="64" context="_257" access="public" location="f0:190" file="f0" line="190"/>
  <Destructor id="_558" name="sp_audioformat" artificial="1" throw="" context="_257" access="public" mangled="_ZN14sp_audioformatD1Ev *INTERNAL* " demangled="sp_audioformat::~sp_audioformat()" location="f0:187" file="f0" line="187" endline="187" inline="1">
  </Destructor>
  <OperatorMethod id="_559" name="=" returns="_637" artificial="1" throw="" context="_257" access="public" mangled="_ZN14sp_audioformataSERKS_" demangled="sp_audioformat::operator=(sp_audioformat const&amp;)" location="f0:187" file="f0" line="187" endline="187" inline="1">
    <Argument type="_638" location="f0:187" file="f0" line="187"/>
  </OperatorMethod>
  <Constructor id="_560" name="sp_audioformat" artificial="1" throw="" context="_257" access="public" mangled="_ZN14sp_audioformatC1ERKS_ *INTERNAL* " demangled="sp_audioformat::sp_audioformat(sp_audioformat const&amp;)" location="f0:187" file="f0" line="187" endline="187" inline="1">
    <Argument type="_638" location="f0:187" file="f0" line="187"/>
  </Constructor>
  <Constructor id="_561" name="sp_audioformat" artificial="1" throw="" context="_257" access="public" mangled="_ZN14sp_audioformatC1Ev *INTERNAL* " demangled="sp_audioformat::sp_audioformat()" location="f0:187" file="f0" line="187" inline="1"/>
  <PointerType id="_562" type="_166c" size="32" align="32"/>
  <PointerType id="_563" type="_502" size="32" align="32"/>
  <PointerType id="_564" type="_124" size="32" align="32"/>
  <PointerType id="_565" type="_323" size="32" align="32"/>
  <Field id="_566" name="logged_in" type="_640" offset="0" context="_309" access="public" location="f0:373" file="f0" line="373"/>
  <Field id="_567" name="logged_out" type="_641" offset="32" context="_309" access="public" location="f0:382" file="f0" line="382"/>
  <Field id="_568" name="metadata_updated" type="_641" offset="64" context="_309" access="public" location="f0:392" file="f0" line="392"/>
  <Field id="_569" name="connection_error" type="_640" offset="96" context="_309" access="public" location="f0:411" file="f0" line="411"/>
  <Field id="_570" name="message_to_user" type="_642" offset="128" context="_309" access="public" location="f0:422" file="f0" line="422"/>
  <Field id="_571" name="notify_main_thread" type="_641" offset="160" context="_309" access="public" location="f0:435" file="f0" line="435"/>
  <Field id="_572" name="music_delivery" type="_643" offset="192" context="_309" access="public" location="f0:456" file="f0" line="456"/>
  <Field id="_573" name="play_token_lost" type="_641" offset="224" context="_309" access="public" location="f0:463" file="f0" line="463"/>
  <Field id="_574" name="log_message" type="_642" offset="256" context="_309" access="public" location="f0:471" file="f0" line="471"/>
  <Field id="_575" name="end_of_track" type="_641" offset="288" context="_309" access="public" location="f0:482" file="f0" line="482"/>
  <Field id="_576" name="streaming_error" type="_640" offset="320" context="_309" access="public" location="f0:496" file="f0" line="496"/>
  <Field id="_577" name="userinfo_updated" type="_641" offset="352" context="_309" access="public" location="f0:503" file="f0" line="503"/>
  <Field id="_578" name="start_playback" type="_641" offset="384" context="_309" access="public" location="f0:516" file="f0" line="516"/>
  <Field id="_579" name="stop_playback" type="_641" offset="416" context="_309" access="public" location="f0:530" file="f0" line="530"/>
  <Field id="_580" name="get_audio_buffer_stats" type="_644" offset="448" context="_309" access="public" location="f0:542" file="f0" line="542"/>
  <Field id="_581" name="offline_status_updated" type="_641" offset="480" context="_309" access="public" location="f0:549" file="f0" line="549"/>
  <Field id="_582" name="offline_error" type="_640" offset="512" context="_309" access="public" location="f0:558" file="f0" line="558"/>
  <Destructor id="_583" name="sp_session_callbacks" artificial="1" throw="" context="_309" access="public" mangled="_ZN20sp_session_callbacksD1Ev *INTERNAL* " demangled="sp_session_callbacks::~sp_session_callbacks()" location="f0:357" file="f0" line="357" endline="357" inline="1">
  </Destructor>
  <OperatorMethod id="_584" name="=" returns="_645" artificial="1" throw="" context="_309" access="public" mangled="_ZN20sp_session_callbacksaSERKS_" demangled="sp_session_callbacks::operator=(sp_session_callbacks const&amp;)" location="f0:357" file="f0" line="357" endline="357" inline="1">
    <Argument type="_646" location="f0:357" file="f0" line="357"/>
  </OperatorMethod>
  <Constructor id="_585" name="sp_session_callbacks" artificial="1" throw="" context="_309" access="public" mangled="_ZN20sp_session_callbacksC1ERKS_ *INTERNAL* " demangled="sp_session_callbacks::sp_session_callbacks(sp_session_callbacks const&amp;)" location="f0:357" file="f0" line="357" endline="357" inline="1">
    <Argument type="_646" location="f0:357" file="f0" line="357"/>
  </Constructor>
  <Constructor id="_586" name="sp_session_callbacks" artificial="1" throw="" context="_309" access="public" mangled="_ZN20sp_session_callbacksC1Ev *INTERNAL* " demangled="sp_session_callbacks::sp_session_callbacks()" location="f0:357" file="f0" line="357" inline="1"/>
  <PointerType id="_587" type="_58c" size="32" align="32"/>
  <Field id="_588" name="playlist_added" type="_648" offset="0" context="_322" access="public" location="f0:2990" file="f0" line="2990"/>
  <Field id="_589" name="playlist_removed" type="_648" offset="32" context="_322" access="public" location="f0:3001" file="f0" line="3001"/>
  <Field id="_590" name="playlist_moved" type="_649" offset="64" context="_322" access="public" location="f0:3013" file="f0" line="3013"/>
  <Field id="_591" name="container_loaded" type="_650" offset="96" context="_322" access="public" location="f0:3021" file="f0" line="3021"/>
  <Destructor id="_592" name="sp_playlistcontainer_callbacks" artificial="1" throw="" context="_322" access="public" mangled="_ZN30sp_playlistcontainer_callbacksD1Ev *INTERNAL* " demangled="sp_playlistcontainer_callbacks::~sp_playlistcontainer_callbacks()" location="f0:2981" file="f0" line="2981" endline="2981" inline="1">
  </Destructor>
  <OperatorMethod id="_593" name="=" returns="_651" artificial="1" throw="" context="_322" access="public" mangled="_ZN30sp_playlistcontainer_callbacksaSERKS_" demangled="sp_playlistcontainer_callbacks::operator=(sp_playlistcontainer_callbacks const&amp;)" location="f0:2981" file="f0" line="2981" endline="2981" inline="1">
    <Argument type="_652" location="f0:2981" file="f0" line="2981"/>
  </OperatorMethod>
  <Constructor id="_594" name="sp_playlistcontainer_callbacks" artificial="1" throw="" context="_322" access="public" mangled="_ZN30sp_playlistcontainer_callbacksC1ERKS_ *INTERNAL* " demangled="sp_playlistcontainer_callbacks::sp_playlistcontainer_callbacks(sp_playlistcontainer_callbacks const&amp;)" location="f0:2981" file="f0" line="2981" endline="2981" inline="1">
    <Argument type="_652" location="f0:2981" file="f0" line="2981"/>
  </Constructor>
  <Constructor id="_595" name="sp_playlistcontainer_callbacks" artificial="1" throw="" context="_322" access="public" mangled="_ZN30sp_playlistcontainer_callbacksC1Ev *INTERNAL* " demangled="sp_playlistcontainer_callbacks::sp_playlistcontainer_callbacks()" location="f0:2981" file="f0" line="2981" inline="1"/>
  <PointerType id="_596" type="_160" size="32" align="32"/>
  <PointerType id="_597" type="_61" size="32" align="32"/>
  <PointerType id="_598" type="_420" size="32" align="32"/>
  <Field id="_599" name="queued_tracks" type="_58" offset="0" context="_419" access="public" location="f0:314" file="f0" line="314"/>
  <Field id="_600" name="queued_bytes" type="_8" offset="32" context="_419" access="public" location="f0:315" file="f0" line="315"/>
  <Field id="_601" name="done_tracks" type="_58" offset="96" context="_419" access="public" location="f0:321" file="f0" line="321"/>
  <Field id="_602" name="done_bytes" type="_8" offset="128" context="_419" access="public" location="f0:322" file="f0" line="322"/>
  <Field id="_603" name="copied_tracks" type="_58" offset="192" context="_419" access="public" location="f0:328" file="f0" line="328"/>
  <Field id="_604" name="copied_bytes" type="_8" offset="224" context="_419" access="public" location="f0:329" file="f0" line="329"/>
  <Field id="_605" name="willnotcopy_tracks" type="_58" offset="288" context="_419" access="public" location="f0:335" file="f0" line="335"/>
  <Field id="_606" name="error_tracks" type="_58" offset="320" context="_419" access="public" location="f0:341" file="f0" line="341"/>
  <Field id="_607" name="syncing" type="_473" offset="352" context="_419" access="public" location="f0:346" file="f0" line="346"/>
  <Destructor id="_608" name="sp_offline_sync_status" artificial="1" throw="" context="_419" access="public" mangled="_ZN22sp_offline_sync_statusD1Ev *INTERNAL* " demangled="sp_offline_sync_status::~sp_offline_sync_status()" location="f0:309" file="f0" line="309" endline="309" inline="1">
  </Destructor>
  <OperatorMethod id="_609" name="=" returns="_653" artificial="1" throw="" context="_419" access="public" mangled="_ZN22sp_offline_sync_statusaSERKS_" demangled="sp_offline_sync_status::operator=(sp_offline_sync_status const&amp;)" location="f0:309" file="f0" line="309" endline="309" inline="1">
    <Argument type="_654" location="f0:309" file="f0" line="309"/>
  </OperatorMethod>
  <Constructor id="_610" name="sp_offline_sync_status" artificial="1" throw="" context="_419" access="public" mangled="_ZN22sp_offline_sync_statusC1ERKS_ *INTERNAL* " demangled="sp_offline_sync_status::sp_offline_sync_status(sp_offline_sync_status const&amp;)" location="f0:309" file="f0" line="309" endline="309" inline="1">
    <Argument type="_654" location="f0:309" file="f0" line="309"/>
  </Constructor>
  <Constructor id="_611" name="sp_offline_sync_status" artificial="1" throw="" context="_419" access="public" mangled="_ZN22sp_offline_sync_statusC1Ev *INTERNAL* " demangled="sp_offline_sync_status::sp_offline_sync_status()" location="f0:309" file="f0" line="309" inline="1"/>
  <PointerType id="_614" type="_655" size="32" align="32"/>
  <PointerType id="_615" type="_656" size="32" align="32"/>
  <PointerType id="_616" type="_657" size="32" align="32"/>
  <PointerType id="_617" type="_658" size="32" align="32"/>
  <PointerType id="_618" type="_659" size="32" align="32"/>
  <PointerType id="_619" type="_660" size="32" align="32"/>
  <PointerType id="_620" type="_661" size="32" align="32"/>
  <PointerType id="_621" type="_662" size="32" align="32"/>
  <PointerType id="_622" type="_663" size="32" align="32"/>
  <PointerType id="_623" type="_664" size="32" align="32"/>
  <ReferenceType id="_624" type="_19" size="32" align="32"/>
  <ReferenceType id="_625" type="_19c" size="32" align="32"/>
  <ArrayType id="_626" min="0" max="0u" type="_504" size="32" align="32"/>
  <ReferenceType id="_627" type="_60" size="32" align="32"/>
  <ReferenceType id="_628" type="_60c" size="32" align="32"/>
  <PointerType id="_631" type="_310c" size="32" align="32"/>
  <ReferenceType id="_632" type="_165" size="32" align="32"/>
  <ReferenceType id="_633" type="_165c" size="32" align="32"/>
  <ReferenceType id="_635" type="_183" size="32" align="32"/>
  <ReferenceType id="_636" type="_183c" size="32" align="32"/>
  <ReferenceType id="_637" type="_257" size="32" align="32"/>
  <ReferenceType id="_638" type="_257c" size="32" align="32"/>
  <PointerType id="_640" type="_671" size="32" align="32"/>
  <PointerType id="_641" type="_672" size="32" align="32"/>
  <PointerType id="_642" type="_673" size="32" align="32"/>
  <PointerType id="_643" type="_674" size="32" align="32"/>
  <PointerType id="_644" type="_675" size="32" align="32"/>
  <ReferenceType id="_645" type="_309" size="32" align="32"/>
  <ReferenceType id="_646" type="_309c" size="32" align="32"/>
  <PointerType id="_648" type="_677" size="32" align="32"/>
  <PointerType id="_649" type="_678" size="32" align="32"/>
  <PointerType id="_650" type="_679" size="32" align="32"/>
  <ReferenceType id="_651" type="_322" size="32" align="32"/>
  <ReferenceType id="_652" type="_322c" size="32" align="32"/>
  <ReferenceType id="_653" type="_419" size="32" align="32"/>
  <ReferenceType id="_654" type="_419c" size="32" align="32"/>
  <CvQualifiedType id="_257c" type="_257" const="1"/>
  <FundamentalType id="_612" name="char" size="8" align="8"/>
  <CvQualifiedType id="_612c" type="_612" const="1"/>
  <CvQualifiedType id="_471c" type="_471" const="1"/>
  <CvQualifiedType id="_183c" type="_183" const="1"/>
